app/views/users/index.html.erb

SELECT "users".* FROM "users"
---
              <% if user.avatar.attached? %>
              <%= image_tag user.avatar.first,alt:'user-pics',class: "img-fluid" %>