app/views/users/show.html.erb

SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = $1  [["user_id", 11]]
---
                <div class="d-flex justify-content-around">
                  <% if !current_user.liked_posts.ids.include?(p.id) %>