app/views/posts/index.html.erb

								<div class="d-flex justify-content-around">
									<% if !current_user.liked_posts.ids.include?(p.id)  %>
---
SELECT "posts".* FROM "posts" ORDER BY "posts"."created_at" DESC