app/controllers/posts_controller.rb

SELECT "friendships"."user_id" FROM "friendships" WHERE "friendships"."friend_id" = $1  [["friend_id", 82]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
SELECT "posts".* FROM "posts" ORDER BY "posts"."created_at" DESC
---
  def index
    receiver = current_user.inverted_friendships.pluck('user_id')
    @recieved_request = User.find(receiver)
    @path_id = current_user.inverted_friendships.ids
    @like = Like.new
    @comment = Comment.new
    @post = Post.new
    @posts = Post.ordered_post

INSERT INTO "posts" ("postcontent", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["postcontent", "This is a random text"], ["user_id", 10], ["created_at", "2019-09-25 09:33:42.820834"], ["updated_at", "2019-09-25 09:33:42.820834"]]
---
  def create
    @post = current_user.posts.build(post_params)
    if @post.save