app/controllers/users_controller.rb

  def index
    @sent_request = current_user.friendships.pluck('friend_id')
    receiver = current_user.inverted_friendships.pluck('user_id')
    @path_id = current_user.inverted_friendships.ids
    @recieved_request = User.find(receiver)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 11], ["LIMIT", 1]]

  def show
    receiver = current_user.inverted_friendships.pluck('user_id')
---
SELECT "friendships"."user_id" FROM "friendships" WHERE "friendships"."friend_id" = $1  [["friend_id", 83]]